In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [2]:
df_clean = pd.read_csv('hr_raw_data_clean.csv', index_col=0)

### FUNCIÓN PARA HOMOGENEIZAR DATOS DE "AGE"

In [3]:
def age(year):
    '''Mantenemos la columna edad actualizada restando el año actual 
    con el año de nacimiento registrado en la columna "datebrith".
    usamos la libreria datetime
    '''
    age_def = (datetime.now().year) - year
    return age_def

df_clean["age"] = df_clean["datebirth"].apply(age)

df_clean.sample(5)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
1216,47,No,travel_rarely,1973.984127,NaN,2,4,NaN,1,1217,3,0,246.748016,3,5,REseARcH DiRectOr,4,NaN,"15943,72$","41453,67$",7,Y,NaN,17,"3,0",3,Full Time,1,"24,0",3,"3,0",2,NaN,2,2,"15943,72$",1977,"191324,62$",NaN,NaN,1
1487,22,No,NaN,213.571429,NaN,-25,1,NaN,1,1488,4,1,26.696429,2,1,REsEaRch scIenTIsT,2,Single,NaN,"4485,00$",1,Y,Yes,11,"3,0",3,Part Time,0,"2,0",6,"4,0",2,NaN,2,2,NaN,2002,"20700,00$",NaN,NaN,1
1060,45,No,NaN,352.857143,NaN,20,3,Life Sciences,1,1061,4,0,44.107143,3,1,rEsEarCH SCIeNtist,2,NaN,"2850,00$","7410,00$",1,Y,NaN,13,"3,0",3,Full Time,0,"6,0",3,"2,0",5,NaN,1,3,"2850,00$",1979,"34200,00$",NaN,NaN,0
1389,46,No,travel_frequently,1863.436508,NaN,25,3,Medical,1,1390,2,1,NaN,3,5,manAGEr,2,NaN,"15050,83$","39132,17$",3,NaN,NaN,22,"4,0",3,Full Time,0,"22,0",4,"3,0",0,NaN,0,0,"15050,83$",1978,"180610,00$",NaN,NaN,0
1499,32,No,travel_rarely,564.158730,NaN,29,4,Marketing,1,1500,1,1,NaN,2,2,saLeS eXEcUTivE,4,NaN,NaN,"11847,33$",1,NaN,NaN,14,"3,0",1,Full Time,2,NaN,3,"3,0",12,NaN,5,7,NaN,1992,"54680,00$",NaN,NaN,1

In [5]:
df_clean["age"].isnull().sum()

np.int64(0)

### FUNCIÓN PARA REEMPLAZAR , por . Y ELIMINAR $

In [6]:
def replace_dot(cadena):
    ''' Para las columnas cuyos valores son object con separación con comas y símbolo 
    de $ al final. 
    Sustituir , por . y eliminar &
    Pasar el valor a float'''
    try:
        # Reemplazar las comas por puntos en la cadena
        return float(cadena.replace(",", ".").replace("$",""))
    
    except:
        # Si ocurre algún error (por ejemplo, si el argumento no es una cadena),
        # devolver np.nan (valor Not a Number) para indicar un valor inválido o no disponible.
        return np.nan

lista_columnas=["monthlyincome", "monthlyrate", "performancerating", "totalworkingyears", "worklifebalance", "sameasmonthlyincome", "salary"]

for columna in lista_columnas:
     df_clean[columna] = df_clean[columna].apply(replace_dot)

df_clean.head(5)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,52,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,16280.83,42330.17,7,Y,No,13,3.0,3,Full Time,0,NaN,5,3.0,20,NaN,15,15,16280.83,1972,195370.0,NaN,NaN,Yes
1,53,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,43331.17,0,NaN,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,NaN,11,9,NaN,1971,199990.0,NaN,NaN,1
2,43,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,41669.33,1,NaN,No,11,3.0,4,NaN,0,22.0,3,NaN,22,NaN,11,15,NaN,1981,192320.0,ManaGER - Research & Development,NaN,1
3,48,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,14307.50,37199.50,3,Y,NaN,19,3.0,2,Full Time,2,NaN,2,NaN,20,NaN,5,6,14307.50,1976,171690.0,NaN,NaN,False
4,47,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,12783.92,33238.20,2,Y,No,12,3.0,4,NaN,1,NaN,5,3.0,19,NaN,2,8,12783.92,1977,NaN,NaN,NaN,0

### redondear valores de tipo float con muchos decimales, a 2 decimales

In [7]:
df_clean["dailyrate"] = round(df_clean["dailyrate"], 2)
df_clean["hourlyrate"] = round(df_clean["hourlyrate"], 2)
df_clean.head(2)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,52,No,NaN,2015.72,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,16280.83,42330.17,7,Y,No,13,3.0,3,Full Time,0,NaN,5,3.0,20,NaN,15,15,16280.83,1972,195370.0,NaN,NaN,Yes
1,53,No,NaN,2063.39,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,43331.17,0,NaN,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,NaN,11,9,NaN,1971,199990.0,NaN,NaN,1

In [17]:
def eliminar_columnas(df, nombre_columna):
    df_drop = df.drop(nombre_columna, axis=1, inplace=True) # hay que asignarle una variable para que lo guarde. Comprobado que funciona, cambiamos el inplace por True.
    print(f'La columna {nombre_columna} se ha eliminado correctamente.')
    return df_drop.head(1)

### FUNCIÓN MAP PARA HOMOGENEIZAR REMOTEWORK

In [8]:
diccionario_remote = {"1": "Yes", "0": "No", "Yes": "Yes", "True": "Yes", "False": "No"}
df_clean["remotework"] = df_clean["remotework"].map(diccionario_remote)

df_clean.head(2)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,52,No,NaN,2015.72,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,16280.83,42330.17,7,Y,No,13,3.0,3,Full Time,0,NaN,5,3.0,20,NaN,15,15,16280.83,1972,195370.0,NaN,NaN,Yes
1,53,No,NaN,2063.39,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,43331.17,0,NaN,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,NaN,11,9,NaN,1971,199990.0,NaN,NaN,Yes

### FUNCIÓN PARA PONER EN MINÚSCULAS

In [9]:
def minusculas(cadena): 
    try:
        return cadena.lower()
    except:
        return "no data"

lista_columnas=["department", "educationfield", "jobrole", "roledepartament"]
for col in lista_columnas:
    df_clean[col] = df_clean[col].apply(minusculas)

## FUNCION PARA RATIOS DE "ENVIRONMENTSATISFACTION"

In [10]:
def clean_satisfaction(valoracion):
    try: 
        if valoracion >= 10:
            return int(str(valoracion/10).split('.')[0])
        else: 
            return valoracion
    except:
            return np.nan


df_clean["environmentsatisfaction"] = df_clean["environmentsatisfaction"].apply(clean_satisfaction)

### GENDER

In [11]:
dict_gender = {0: "M", 1: "F"}

df_clean["gender"] = df_clean["gender"].map(dict_gender)

# 14 de noviembre de 2024

### FUNCIÓN PARA BORRAR COLUMNAS

In [19]:
def clean (dataframe,col_data):
    
    return dataframe.drop([col_data],axis=1, inplace= True)

In [29]:
lista_drop= ["sameasmonthlyincome", "over18", "numberchildren", "employeecount"]

for col in lista_drop:
    clean(df_clean, col)

In [68]:
df_clean[["yearsincurrentrole", "yearssincelastpromotion", "yearsatcompany"]].sample(10)

     yearsincurrentrole  yearssincelastpromotion  yearsatcompany
517                 6,0                        8              21
1332                NaN                        0               3
273                 NaN                        2               9
7                   NaN                       11              20
874                 NaN                        7               8
352                 NaN                        4              15
884                 2,0                        2               3
670                 NaN                        0               4
1046                NaN                        2               2
1603                NaN                        7               8

In [41]:
df_clean[["joblevel","jobrole", "roledepartament","department"]].sample(10)

,joblevel,jobrole,roledepartament,department
1104,1,human resources,human resources - human resources,human resources
507,3,healthcare representative,no data,no data
651,1,laboratory technician,laboratory technician - research & developm...,research & development
290,2,sales executive,no data,no data
1658,1,laboratory technician,laboratory technician - research & developm...,research & development
836,1,laboratory technician,no data,no data
359,1,research scientist,no data,no data
1399,1,sales representative,no data,no data
138,4,manager,manager - sales,sales
440,2,manufacturing director,manufacturing director - research & develop...,research & development

### GUARDAR CSV

In [70]:
df_clean.to_csv("hr_raw_data_clean.csv")

18.11.2024 PROYECTO

In [7]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', None)

In [8]:
df_clean = pd.read_csv('hr_raw_data_clean.csv', index_col=0)
df_clean.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,datebirth,salary,roledepartament,remotework
0,52,No,NaN,2015.72,no data,6,3,no data,1,1,M,NaN,3,5,research director,3,NaN,16280.83,42330.17,7,No,13,3.0,3,Full Time,0,NaN,5,3.0,20,NaN,15,15,1972,195370.0,no data,Yes
1,53,No,NaN,2063.39,no data,1,4,life sciences,2,3,M,NaN,2,5,manager,3,NaN,NaN,43331.17,0,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,NaN,11,9,1971,199990.0,no data,Yes
2,43,No,travel_rarely,1984.25,research & development,4,2,technical degree,3,3,M,NaN,3,5,manager,4,Married,NaN,41669.33,1,No,11,3.0,4,NaN,0,22.0,3,NaN,22,NaN,11,15,1981,192320.0,manager - research & development,Yes
3,48,No,travel_rarely,1771.40,no data,2,4,medical,4,1,F,NaN,3,4,research director,3,Married,14307.50,37199.50,3,NaN,19,3.0,2,Full Time,2,NaN,2,NaN,20,NaN,5,6,1976,171690.0,no data,No
4,47,No,NaN,1582.77,no data,3,3,technical degree,5,1,F,NaN,4,4,sales executive,1,Divorced,12783.92,33238.20,2,No,12,3.0,4,NaN,1,NaN,5,3.0,19,NaN,2,8,1977,NaN,no data,No

ELIMINAR '-' EN COLUMNA DISTANCEFROMHOME

In [9]:
'''Sacando columnas numéricas para ver si hay alguna columna más con negativos aparte del distancefromhome'''
df_numericas = df_clean.select_dtypes(include=['number'])

In [10]:
''' ¿Cuántas veces está el - en cada columna numérica? Vemos que solo está presente en distancefromhome'''
for col in df_numericas.columns:
    num_menos_col = df_numericas[col].astype(str).str.contains('-', regex=False).sum()
    print(f' - está presente en {col} {num_menos_col} veces.')

 - está presente en age 0 veces.
 - está presente en dailyrate 0 veces.
 - está presente en distancefromhome 202 veces.
 - está presente en education 0 veces.
 - está presente en employeenumber 0 veces.
 - está presente en environmentsatisfaction 0 veces.
 - está presente en hourlyrate 0 veces.
 - está presente en jobinvolvement 0 veces.
 - está presente en joblevel 0 veces.
 - está presente en jobsatisfaction 0 veces.
 - está presente en monthlyincome 0 veces.
 - está presente en monthlyrate 0 veces.
 - está presente en numcompaniesworked 0 veces.
 - está presente en percentsalaryhike 0 veces.
 - está presente en performancerating 0 veces.
 - está presente en relationshipsatisfaction 0 veces.
 - está presente en stockoptionlevel 0 veces.
 - está presente en totalworkingyears 0 veces.
 - está presente en trainingtimeslastyear 0 veces.
 - está presente en worklifebalance 0 veces.
 - está presente en yearsatcompany 0 veces.
 - está presente en yearssincelastpromotion 0 veces.
 - está presente en yearswithcurrmanager 0 veces.
 - está presente en datebirth 0 veces.
 - está presente en salary 0 veces.

In [11]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 37 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   int64
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                1678 non-null   object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            1678 non-null   object
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  hourlyrate                411 non-null    float64
 12  jobinvolvement            1678 non-null   int64
 13  joblevel                  1678 non-null   int64
 14  jobrole                   1678 non-null   object
 15  jobsatisfaction           1678 non-null   int64
 16  maritalstatus             1003 non-null   object
 17  monthlyincome             1189 non-null   float64
 18  monthlyrate               1678 non-null   float64
 19  numcompaniesworked        1678 non-null   int64
 20  overtime                  982 non-null    object
 21  percentsalaryhike         1678 non-null   int64
 22  performancerating         1478 non-null   float64
 23  relationshipsatisfaction  1678 non-null   int64
 24  standardhours             1327 non-null   object
 25  stockoptionlevel          1678 non-null   int64
 26  totalworkingyears         1129 non-null   float64
 27  trainingtimeslastyear     1678 non-null   int64
 28  worklifebalance           1564 non-null   float64
 29  yearsatcompany            1678 non-null   int64
 30  yearsincurrentrole        35 non-null     object
 31  yearssincelastpromotion   1678 non-null   int64
 32  yearswithcurrmanager      1678 non-null   int64
 33  datebirth                 1678 non-null   int64
 34  salary                    1393 non-null   float64
 35  roledepartament           1678 non-null   object
 36  remotework                1678 non-null   object
dtypes: float64(8), int64(17), object(12)
memory usage: 498.2+ KB

In [13]:
def convert_negatives_in_absolute(df, columns): 
    df[columns] = df[columns].abs()  # Aplica abs() solo a las columnas seleccionadas 
    return df # Llamar a la función, por ejemplo, para convertir las columnas 'A' y 'B'
df_clean = convert_negatives_in_absolute(df_clean, 'distancefromhome') # Mostrar el resultado print(df)
df_clean.sample(10)

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,datebirth,salary,roledepartament,remotework
1422,33,Yes,travel_rarely,143.72,no data,2,4,life sciences,1423,4,M,NaN,3,1,laboratory technician,2,Single,NaN,3018.17,1,No,12,3.0,1,Part Time,0,1.0,2,3.0,1,NaN,0,0,1991,13930.00,no data,Yes
1186,35,No,travel_rarely,556.26,no data,8,2,no data,1187,2,F,NaN,3,2,healthcare representative,3,NaN,4492.84,11681.39,3,No,11,3.0,4,Part Time,0,10.0,2,3.0,5,NaN,4,3,1989,53914.11,no data,Yes
969,23,Yes,travel_rarely,556.26,no data,3,1,life sciences,970,2,F,NaN,3,2,manufacturing director,3,Married,4492.84,11681.39,0,Yes,19,3.0,1,Part Time,1,4.0,3,4.0,3,NaN,0,2,2001,53914.11,no data,Yes
1629,38,No,NaN,1032.49,no data,11,3,no data,191,2,M,NaN,3,3,research director,4,NaN,NaN,21682.23,1,NaN,14,3.0,3,Part Time,3,NaN,1,3.0,10,NaN,0,7,1986,100071.84,no data,Yes
114,52,No,travel_rarely,1288.65,no data,8,4,life sciences,115,2,M,NaN,2,3,research director,2,Married,10408.33,27061.67,5,No,16,3.0,4,Full Time,2,16.0,5,1.0,10,NaN,4,7,1972,124900.00,no data,No
454,34,No,non-travel,531.04,no data,2,3,marketing,455,4,F,NaN,3,2,sales executive,2,NaN,4289.17,11151.83,8,No,15,3.0,4,Part Time,0,13.0,2,2.0,11,NaN,1,7,1990,51470.00,no data,Yes
381,29,No,travel_rarely,377.62,no data,10,3,other,382,3,F,NaN,3,2,research scientist,3,Single,3050.00,7930.00,3,No,13,3.0,4,NaN,0,NaN,4,4.0,8,NaN,1,7,1995,NaN,no data,Yes
16,59,Yes,travel_rarely,1985.70,no data,2,4,no data,17,4,M,NaN,3,5,research director,2,Single,16038.33,41699.67,7,Yes,12,3.0,4,Full Time,0,40.0,2,3.0,31,NaN,13,8,1965,192460.00,no data,No
1123,38,No,travel_rarely,556.26,sales,9,2,marketing,1124,2,M,NaN,2,2,sales executive,2,NaN,4492.84,11681.39,1,No,14,3.0,1,Part Time,2,NaN,2,3.0,5,NaN,0,3,1986,53914.11,sales executive - sales,No
745,53,No,travel_frequently,1582.77,no data,28,2,no data,746,4,F,NaN,4,4,manufacturing director,3,Married,12783.92,33238.20,2,NaN,11,3.0,2,Full Time,1,NaN,3,2.0,5,NaN,0,2,1971,153407.07,no data,Yes

In [14]:
df_clean['distancefromhome'].astype(str).str.contains('-', regex=False).sum()

np.int64(0)

In [ ]:
df_clean['distancefromhome'].value_counts()

CREAR COLUMNA NUEVA DE DEPARTAMENTO A PARTIR DE LA INFO QUE TENEMOS EN EL DF[['jobrole', 'roledepartament', 'department']]

In [16]:
'''Creamos un diccionario con los puestos como claves y los departamentos como valores.
Función que asigna el departamento según el puesto. Si no encuentra la clave en el diccionario, devuelve el valor de la columna
roledepartament para que no se cambien los manager que sí están asignados a algunos departamentos concretos - sales, human resources, etc.'''

dic = {'healthcare representative': 'research & development',
       'sales executive': 'sales',
       'laboratory technician': 'research & development',
       'manufacturing director': 'research & development',
       'research scientist': 'research & development',
       'research director': 'research & development',
       'human resources': 'human resources',
       'sales representative': 'sales'}

def assign_departament(puesto, departamento, otra_columna):
    return departamento.get(puesto, otra_columna)

# Limpiamos la columna 'jobrole' de espacios y le hacemos un lower, ya que no estaba reconociendo las claves y es posible que hubiera algún 
# espacio en alguna celda.
df_clean['jobrole'] = df_clean['jobrole'].str.strip().str.lower()

# Asignamos el departamento correspondiente para cada puesto en la columna 'correct_department'
df_clean['correct_department'] = df_clean.apply(lambda fila: assign_departament(fila['jobrole'], dic, fila['roledepartament']), axis=1)

ELIMINAR COLUMNA 'ROLEDEPARTAMENT' Y 'DEPARTMENT'

In [21]:
# Utilizamos función creada previamente.

lista_drop1= ["roledepartament", "department"]

for col in lista_drop1:
    clean(df_clean, col)

CAMBIAMOS NOMBRE DE COLUMNA 'CORRECT_DEPARTMENT' A 'DEPARTMENT'

In [24]:
df_clean.rename(columns={'correct_department': 'department'}, inplace=True)

Introducir los valores que faltan en la columna 'salary' multiplicando el 'monthlyincome' * 12.

In [26]:
'''Sacamos un sample de la columna 'salary' para ver qué fila tiene NaN y luego poder hacer comprobaciones'''
df_clean['salary'].sample(10)

1146     53914.11
795      53914.11
584      28111.13
1674    191324.62
1518     39830.00
578           NaN
1373     28530.00
598      63220.00
420     153407.07
1207    119160.00
Name: salary, dtype: float64

In [29]:
'''Si la celda es mayor a 0, es decir tiene dato, se queda tal cual, si no, multiplicamos 'monthlyincome' * 12 para calcular salario anual.'''
df_clean['salary'] = df_clean.apply(lambda row: row['salary'] if row['salary'] > 0 else row['monthlyincome'] * 12, axis = 1)

In [30]:
'''comprobamos que la fila 578 contiene un valor'''
df_clean['salary'].iloc[578]

np.float64(65019.96)

In [31]:
'''comprobamos que la multiplicación se ha hecho de manera correcta.'''
df_clean['monthlyincome'].iloc[578] * 12

np.float64(65019.96)

In [32]:
'''¿hay nulos ahora en esa columna?'''
df_clean['salary'].isnull().sum()

np.int64(0)

In [33]:
df_clean.to_csv("hr_raw_data_clean.csv")